Repository: kecsetihunor/LoanSimulator
Catalog: src/locale/messages.*.xlf
Languages: ro

source: Advanced Loan Calculator
ro: Calculator avansat de credite

source: Calculate payments with fixed and variable interest rates.
ro: Calculează plățile cu rate ale dobânzii fixe și variabile.

source: Annuity (Equal Payments)
ro: Vezi scadențar (rate egale)

source: Linear (Decreasing Payments)
ro: Vezi scadențar (rate descrescătoare)

source: Loan Amount
ro: Sumă

source: e.g. 10000.00
ro: de ex. 10000.00

source: Enter the total loan amount
ro: Introduceți suma totală a creditului

source: Total Period: {{ totalPeriod }} months
ro: Perioada totală: {{ totalPeriod }} luni

source: e.g. 12
ro: de ex. 12

source: Total loan duration (1-480 months)
ro: Durata totală a creditului (1-480 luni)

source: Fixed Rate Period: {{ fixedMonths }} months
ro: Perioada cu dobândă fixă: {{ fixedMonths }} luni

source: Months with fixed interest rate
ro: Luni cu dobândă fixă

source: Fixed Interest Rate
ro: Dobândă fixă

source: Rate for first {{ fixedMonths }} months
ro: Dobândă pentru primele {{ fixedMonths }} luni

source: Variable Interest Rate
ro: Dobândă variabilă

source: Rate for remaining {{ totalPeriod! - fixedMonths! }} months
ro: Dobândă pentru restul de {{ totalPeriod! - fixedMonths! }} luni

source: Insurance rate:
ro: Asigurare de viață:

source: e.g. 0.03
ro: de ex. 0.03

source: Insurance rate as a percentage (e.g., 5.5).
ro: Dobândă asigurare de viață (de ex. 0.03).

source: Schedules:
ro: Scadențar:

source: Annuity
ro: Rate egale

source: Linear
ro: Rate descrescătoare

source: Amount
ro: Sumă

source: Enter a positive decimal amount.
ro: Introduceți suma totală a creditului

source: Interest period: {{ period || 0 }} months
ro: Perioada totală: {{ period || 0 }} luni

source: Enter or slide to ` months (1-480).
ro: Durata totală a creditului (1-480 luni)

source: Interest rate
ro: Dobânda creditului

source: e.g. 5.5
ro: de ex. 5.5

source: Annual rate as a percentage (e.g., 5.5).
ro: Dobandă anuală ca procent (de ex., 5.5).

source: Simple Loan Calculator
ro: Calculator de credite

source: Calculate your monthly payments with a single fixed interest rate.
ro: Calculează plățile lunare cu o singură rată fixă a dobânzii.

source: Loan Simulator
ro: Simulator de Credite

source: Simple Calculator
ro: Calculator Simplu

source: Advanced Calculator
ro: Calculator Avansat

source: Compare Loans
ro: Compară Credite

source: Settings
ro: Setări

source: Amortization Schedule
ro: Scadențar credit

source: Mo
ro: Lună

source: Payment
ro: Plată

source: Interest
ro: Dobândă

source: Insur
ro: Asigurare

source: Balance
ro: Sold

source: Show Less
ro: Arată mai puțin

source: Show All {{schedule.length}}
ro: Arată Tot {{schedule.length}}

source: Loan Details
ro: Detalii credit

source: Loan Amount:
ro: Suma creditului:

source: Total Period:
ro: Perioada totală:

source: this.totalPeriod months
ro: this.totalPeriod luni

source: Fixed Rate:
ro: Dobândă fixă:

source: this.fixedRate% (first this.fixedMonths months)
ro: this.fixedRate% (primele this.fixedMonths luni)

source: Variable Rate:
ro: Dobândă variabilă:

source: this.variableRate% (remaining this.totalPeriod! - this.fixedMonths! months)
ro: this.variableRate% (restul de this.totalPeriod! - this.fixedMonths! luni)

source: Interest Rate:
ro: Dobândă:

source: Payment Type:
ro: Tip rată:

source: Month
ro: Lună

source: Insurance
ro: Asigurare

source: Remaining Balance
ro: Sold rămas

source: Annuity Payment
ro: Prima plată - Rate egale

source: Equal monthly payments
ro: Plăți lunare egale

source: <strong>Total payback:</strong>
ro: <strong>Valoarea totală de rambursat:</strong>

source: <strong>Total interest:</strong>
ro: <strong>Dobândă totală:</strong>

source: Linear - First Payment
ro: Prima plată - Rate descrescătoare

source: Decreasing payments (equal principal)
ro: Plăți descrescătoare (principal egal)

source: Save
ro: Economisești

source: vs. Annuity
ro: față de rate egale
